postman-data-extension-templates/_Job

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <Header>
        <Action>Create</Action>
        <To>https://{{subdomain}}.soap.marketingcloudapis.com/Service.asmx</To>
        <fueloauth xmlns="http://exacttarget.com">{{dne_etAccessToken}}</fueloauth>
    </Header>
    <Body>
        <CreateRequest xmlns="http://exacttarget.com/wsdl/partnerAPI">
            <Options></Options>
            <Objects xmlns:ns1="http://exacttarget.com/wsdl/partnerAPI" xsi:type="ns1:DataExtension">
                <CustomerKey>Job_Data_View</CustomerKey>
                <Name>Job_Data_View</Name>
                <IsSendable>false</IsSendable>
                <Fields>
                    <Field>
                        <Name>JobID</Name>
                        <FieldType>Number</FieldType>
                    </Field>
                    <Field>
                        <Name>EmailID</Name>
                        <FieldType>Number</FieldType>
                    </Field>
                    <Field>
                        <Name>AccountID</Name>
                        <FieldType>Number</FieldType>
                    </Field>
                    <Field>
                        <Name>AccountUserID</Name>
                        <FieldType>Number</FieldType>
                    </Field>
                    <Field>
                        <Name>FromName</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>130</MaxLength>
                    </Field> 
                    <Field>
                        <Name>FromEmail</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>255</MaxLength>
                    </Field> 
                    <Field>
                        <Name>TestEmailAddr</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>128</MaxLength>
                    </Field> 
                    <Field>
                        <Name>BccEmail</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field> 
                    <Field>
                        <Name>EmailName</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field> 
                    <Field>
                        <Name>EmailSubject</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>200</MaxLength>
                    </Field> 
                    <Field>
                        <Name>DynamicEmailSubject</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>500</MaxLength>
                    </Field>                                                                                                                       
                    <Field>
                        <Name>SendClassificationType</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>32</MaxLength>
                    </Field>                                                                                                                       
                    <Field>
                        <Name>SendClassification</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>32</MaxLength>
                    </Field>   
                    <Field>
                        <Name>EmailSendDefinition</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>36</MaxLength>
                    </Field>                     
                    <Field>
                        <Name>Category</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>100</MaxLength>
                    </Field> 
                    <Field>
                        <Name>SchedTime</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>PickupTime</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>DeliveredTime</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>OriginalSchedTime</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>CreatedDate</Name>
                        <FieldType>Date</FieldType>
                    </Field> 
                    <Field>
                        <Name>EventID</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>50</MaxLength>
                    </Field> 
                    <Field>
                        <Name>IsMultipart</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>                                          
                    <Field>
                        <Name>JobType</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>50</MaxLength>
                    </Field>                                            
                    <Field>
                        <Name>JobStatus</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>50</MaxLength>
                    </Field>                                            
                    <Field>
                        <Name>CharacterSet</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>30</MaxLength>
                    </Field>                                            
                    <Field>
                        <Name>IPAddress</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>50</MaxLength>
                    </Field>                                            
                    <Field>
                        <Name>ModifiedBy</Name>
                        <FieldType>Number</FieldType>
                    </Field>                                            
                    <Field>
                        <Name>ModifiedDate</Name>
                        <FieldType>Date</FieldType>
                    </Field>    
                    <Field>
                        <Name>IsWrapped</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>    
                    <Field>
                        <Name>SuppressTracking</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>    
                    <Field>
                        <Name>SalesForceTotalSubscriberCount</Name>
                        <FieldType>Number</FieldType>
                    </Field>                                                                                
                    <Field>
                        <Name>SalesForceErrorSubscriberCount</Name>
                        <FieldType>Number</FieldType>
                    </Field>   
                    <Field>
                        <Name>SendType</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>128</MaxLength>
                    </Field>   
                    <Field>
                        <Name>TriggererSendDefinitionObjectID</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>36</MaxLength>
                    </Field>   
                    <Field>
                        <Name>TriggeredSendCustomerKey</Name>
                        <FieldType>Text</FieldType>
                        <MaxLength>36</MaxLength>
                    </Field>   
                    <Field>
                        <Name>ResolveLinksWithCurrentData</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>                                                                                                                                         
                    <Field>
                        <Name>DeduplicateByEmail</Name>
                        <FieldType>Boolean</FieldType>
                    </Field>                                                                                                                                         
                </Fields>
            </Objects>
        </CreateRequest>
    </Body>
</Envelope>
